file = open('text.txt' , 'r')                     # เปิดไฟล์ text.txt ให้เป็นประเภท read mode แล้วเก็บไว้ในตัวแปร file
a = []                                            # สร้าง list เปล่าเก็บไว้ในตัวแปร a
for i in range(0,10) :                            # iterate เลข 0 ถึง 9 ผ่านตัวแปร i
    a.append(int(input('Please enter a value '))) # input ตัวเลข integer แล้วเพิ่มเข้าไปใน list a 
    # a.append(int(file.readline()))              # เป็น comment ไม่นำไปประมวลผล
#######################
print(a)                                          # แสดง list a ออกมาทางหน้าจอ
print()                                           # ขึ้นบรรทัดใหม่
#######################
for i in reversed (range(0,len(a))):              # interate จำนวนของข้อมูลใน list a จนถึง 0 ผ่านตัวแปร i
    print(a[i]," ",end="")                        # แสดงค่าใน list a ลำดับที่ i ต่อด้วยช่องว่าง 1 ช่อง และให้ code print() ในบรรทัดถัดไปถูกนำมาต่อจากข้อความนี้
print()                                           # ขึ้นบรรทัดใหม่
########################
for x in a:                                       # iterate ข้อมูลใน list a ผ่านตัวแปร x
    print(x," ")                                  # แสดงค่า x และต่อด้วยช่องว่าง 1 ช่อง
print()                                           # ขึ้นบรรทัดใหม่
########################
for x in a:                                       # iterate ข้อมูลใน list a ผ่านตัวแปร x
    if x%2 == 0 :                                 # ถ้า x หารด้วย 2 ลงตัว
        print(x," ")                              # แสดงค่า x และต่อด้วยช่องว่าง 1 ช่อง
print()                                           # ขึ้นบรรทัดใหม่

########################
print(a[::-1])                                    # สลับตำแหน่งค่าใน list a โดยไล่จากหลังมาหน้าทีละ 1 ตำแหน่ง
print()                                           # ขึ้นบรรทัดใหม่
########################
count = 0                                         # กำหนดให้ตัวแปร count เป็น 0
for x in a:                                       # iterate แต่ละค่าใน list a เข้าตัวแปร x
    if x % 2 ==0:                                 # ถ้า x หารด้วย 2 ลงตัว
        count+=1                                  # ให้บวกค่าเข้าไปใน count ครั้งละ 1

print(count)                                      # แสดงค่าของตัวแปร count ออกทางหน้าจอ
print()                                           # ขึ้นบรรทัดใหม่ 
########################

max2 = a[0]                                       # กำหนดให้ตัวแปร max2 เก็บข้อมูลลำดับแรกสุดใน list a
for x in a:                                       # iterate ข้อมูลใน list a ผ่านตัวแปร x
    if x > max2:                                  # ถ้า x มากกว่า max2
        max2 = x                                  # กำหนดให้ตัวแปร max2 เก็บข้อมูลที่อยู่ในตัวแปร x
print(max2)                                       # แสดงค่าของตัวแปร max2 ออกทางหน้าจอ
print()                                           # ขึ้นบรรทัดใหม่
########################
max2 = max([l for l in a])                        # สำหรับแต่ละตัวแปร l ใน list a ให้หาค่าตัวแปร l ที่มากที่สุดแล้วเก็บค่าไว้ในตัวแปร max2
print(max2)                                       # แสดงค่าของตัวแปร max2 ออกทางหน้าจอ
print()                                           # ขึ้นบรรทัดใหม่


print([x for x in a if x%2 != 0])                 # แสดงค่าของตัวแปร x ออกทางหน้าจอ สำหรับข้อมูลแต่ละตัวใน list a ถ้า x หารด้วย 2 ไม่ลงตัว

#print (sorted(a))                                # เป็น comment ไม่นำไปประมวลผล

########bubble sort###############
for i in range(0,len(a)):                         # iterate เลข 0 ถึงจำนวนข้อมูลใน list a ผ่านตัวแปร i
    for j in range (0,len(a)-i-1):                # iterate เลข 0 ถึงจำนวนข้อมูลใน list a ที่ถูกหักด้วย i และ 1 ผ่านตัวแปร j
        if a[j] > a[j+1]:                         # ถ้าข้อมูลลำดับที่ j ใน list a มากกว่าข้อมูลลำดับที่ j+1 ใน list a
            temp = a[j]                           # ให้มีตัวแปรชื่อ temp เก็บค่าข้อมูลลำดับที่ j ใน list a
            a[j] = a[j+1]                         # ให้ตัวแปรลำดับที่ j ใน list a เก็บค่าข้อมูลลำดับที่ j+1 ใน list a
            a[j+1] = temp                         # ให้ตัวแปรลำดับที่ j+1 ใน list a เก็บค่าข้อมูลจากตัวแปร temp

print(a)                                          # แสดงค่าของตัวแปร a ออกทางหน้าจอ
t = 1                                             # ให้มีตัวแปร t เก็บค่า 1
print([t = t*x for x in a])                       # สำหรับตัวแปร x แต่ละตัวใน list a ให้นำ x ไปคูณกับ t แล้วนำผลคูณไปแทนค่าใน t (แบบทบต้น)